
/*Функция проверки победы. Получает в качестве параметра итоговый результат.
Если победа достигнута - возвращает истину, в противном случае - ложь*/
bool isWon(int);

/*Функия генерирует рандомное значение 6-и гранной кости. Возвращает случайне число от 1 до 6*/
int generateDiceValues();

/*Функия заполняет массив n-ым количеством рандомных значений 6-и гранной кости. 
Получает в качестве параметра указатель на маасив, количество неиспользованных костей и функцию генерации случайных чисел*/
void fillRandomDices(int*, int, int (*)());

/*Функция выводит на печать массив костей. 
Получает в качестве параметра указатель на массив костей и количество неиспользованных костей*/
void printDices(int*, int);

/*Функция считывает номера выбранных игроком костей о определяет их количество.
Получает в качестве параметра указатель на количество использованных костей и указатель на массив выбранных костей*/
void playerMove(int*, int*);

/*Функция выбирает все приносящие очки кости.
Получает в качестве параметра указатель на количество использованных костей и указатель на массив кол-ва костей каждого номинла*/
void botMove(int*, int*);

/*Функция записывает все кости как выбранные.
Получает в качестве параметра указатель на массив выбранных костей и количество неиспользованных костей*/
void selectAllDice(int*, int);

/*Функция записывает в массив количество костей каждого номинала.
Получает в качестве параметра указатель на массив выбранных костей,
указатель на массив всех сгенерированных костей и указатель на массив отсортированных костей*/
void sortByQuantity(int*, int*, int*);

/*Функция считает сумму выбранных костей.
Получает в качестве параметра указатель на массив кол-ва костей каждого номинала и указатель на переменную для записи суммы*/
void calculateTheSum(int*, int*);

/*Функция обрабатывает решение игрока о продолжении раунда или его завершении.
Получает в качестве параметра указатель на сумму, указатель на кол-во выбранных костей,
указатель на итоговый результат игрока и возвращает выбор игрока*/
int playersRoundResult(int*, int*, int*);

/*Функция обрабатывает решение бота о продолжении раунда или его завершении.
Получает в качестве параметра указатель на сумму, указатель на кол-во выбранных костей,
указатель на итоговый результат бота и возвращает выбор бота*/
int botRoundResult(int*, int*, int*);
